export interface Scale {
    id: string;
    name: string;
    left: string;
    right: string;
}

export interface Question {
    id: number;
    text: string;
    category: string;
    categoryText: string;
    effect: number;
}

export const SCALES: Scale[] = [
    { "id": "auth_lib", "name": "سلطويّة مقابل ليبرالية", "left": "تحررية", "right": "سلطوية" },
    { "id": "rel_sec", "name": "ديني مقابل علماني", "left": "علمانية", "right": "دينية" },
    { "id": "soc_cap", "name": "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", "left": "رأسمالية", "right": "اشتراكية" },
    { "id": "nat_glob", "name": "وطنيّ مقابل عالمي", "left": "عالمية", "right": "وطنيّة" },
    { "id": "mil_pac", "name": "عسكري توسّعي مقابل سلمي انعزالي", "left": "سلميّ انعزالي", "right": "عسكري توسّعي" },
    { "id": "ret_rec", "name": "عدالة انتقالية انتقامية مقابل تصالحية", "left": "عدالة تصالحية", "right": "عدالة انتقامية" }
];

export const DEFAULT_QUESTIONS: Question[] = [
    { id: 1, text: "يجب على الدولة العمل على فرض حد معين من القواعد الأخلاقية في المجتمع", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: -1 },
    { id: 2, text: "يجب على الدولة السماح بتشكيل الأحزاب والترويج لها", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 3, text: "يجب على الدولة السماح للمواطنين بالاعتصام والتظاهر دون ترخيص", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 4, text: "يجب على الدولة السماح للمواطنين بالاضراب للاعتراض على القوانين حتى لو أدّت هذه الإضرابات إلى تعطيل المؤسسات", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 5, text: "يجب على الدولة إتاحة تقارير شفافة عن نتائج عمل كلّ مؤسساتها", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 6, text: "يجب أن تكفل الدولة حرية التعبير للمواطنين ولو أساؤو إليها لفظياً", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 7, text: "يجب أن يكفل قانون الدولة الحصانة للصحفيين والمراسلين لضمان حرية الصحافة", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 8, text: "يجب على الدولة تحديد حدود الفكر المقبول تواجده في مساحات الحياة السياسية وإقصاء أفكار محددة لكونها متطرفة", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: -1 },
    { id: 9, text: "يجب على الدولة بناء دستور لا يسمح بالاستئثار بالسلطة والحكم الأبديّ", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: 1 },
    { id: 10, text: "يمكن للدولة فرض قانون يمنع التظاهر والاعتصام في البلاد متى شائت", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: -1 },
    { id: 11, text: "على الدولة منع الصحفيين الأجانب من التحقيق في شؤون الفساد المحليّ", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: -0.5 },
    { id: 12, text: "على الدولة امتلاك سجون سياسيّة خاصّة لأصحاب الفكر المتطرف", category: "auth_lib", categoryText: "سلطويّة مقابل ليبرالية", effect: -0.5 },
    { id: 13, text: "يجب على الدولة إقرار الزواج المدني بغض النظر عن الطائفة أو الدين", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: 1 },
    { id: 14, text: "يجب على الدولة أن تميّز المواطن المسلم تمييزاً إيجابياً وتقدم له حقوق وواجبات إضافيّة", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 15, text: "يجب على الدولة حماية حق الأديان المختلفة في العبادة في المساحات العامة", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -0.5 },
    { id: 16, text: "يجب على الدولة دعم المنظمات الدينية مادياً", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 17, text: "يجب ألّا تتدخل الدولة في الحياة الدينية للمواطنين", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: 0.5 },
    { id: 18, text: "يجب على الدولة فرض الضرائب على التبرعات المجموعة في المنظمات الدينية", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: 1 },
    { id: 19, text: "يجب على حاكم الدولة أن يكون من الأغلبية الدينية في البلاد", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 20, text: "يجب على الدولة أن تمنع بيع الكحول في البلاد بالكامل", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 21, text: "حريّة اللباس تشمل لبس النساء لملابس الرجال ولبس الرجال لملابس النساء", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: 1 },
    { id: 22, text: "يجب على الدولة جمع الزكاة وتوزيعها بنفسها دون ترك الأمر للمنظمات الدينية المستقلة", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -0.5 },
    { id: 23, text: "يجب على الدولة تسجيل دين المواطنين وطائفتهم وإظهارها في الأوراق الرسمية مثل الهويّات الشخصية", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 24, text: "يجب على الدولة منع تغيير الديانة والمعاقبة عليها", category: "rel_sec", categoryText: "ديني مقابل علماني", effect: -1 },
    { id: 25, text: "يجب أن يكون التعليم في الجامعات والمدارس مجانيّ لكافة المواطنين", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -1 },
    { id: 26, text: "يجب أن تكون الطبابة مجّانيّة لكافة المواطنين", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -1 },
    { id: 27, text: "يجب على الدولة التكفل بإسكان كل من خسر منزله في الثورة", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -1 },
    { id: 28, text: "يجب على الدولة التكفل بدعم العاطلين عن العمل مادياً", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -1 },
    { id: 29, text: "يجب على الدولة فرض ضرائب أكثر على أصحاب الدخل الأعلى", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -1 },
    { id: 30, text: "يجب على الدولة أن تسمح ببيع مؤسسات البنى التحتية مثل المطارات والموانئ لشركات من خارج البلاد", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 1 },
    { id: 31, text: "يجب على الدولة تشجيع المواطنين وتحفيزهم لاعتماد مصادر الطاقة البديلة على نفقة المواطنين الشخصية", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 0.5 },
    { id: 32, text: "يجب على الدولة اجبار الشركات على تقديم اجازات أبوية للموظفين", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: -0.5 },
    { id: 33, text: "يجب على الدولة اعتماد مبدأ السوق الحرة بالكامل ورفع الدعم عن كل المواد ولو كان هذا على مراحل", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 0.5 },
    { id: 34, text: "يجب على الدولة العمل باتجاه تحقيق نمو اقتصادي مستمر للبلاد ولو كان هذا عن طريق الاقتراض من صندوق النقد الدولي", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 1 },
    { id: 35, text: "يجب على الدولة ربط العملة بعملة أجنبية أكثر استقراراً مثل الدولار أو اليورو بدلاً من اعتماد قيمة مستقلة للعملة", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 1 },
    { id: 36, text: "يجب على الدولة إعادة الأملاك التي استولى عليها النظام السابق إلى أصحابها", category: "soc_cap", categoryText: "اقتصادي اشتراكي مقابل اقتصادي ليبرالي", effect: 0.5 },
    { id: 37, text: "يجب على الدولة السعي لتحقيق السلام مع إسرائيل", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 1 },
    { id: 38, text: "يجب على الدولة أن تتبع سياسة عدم الانحياز في كل الصراعات الجارية في المنطقة", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 0.5 },
    { id: 39, text: "يجب على الدولة السماح لكافة المواطنين العرب بالدخول دون فيزا", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -0.5 },
    { id: 40, text: "يجب على الدولة قبول قروض من صندوق النقد الدولي لتسريع النمو في البلاد", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 1 },
    { id: 41, text: "يجب على الدولة استضافة قواعد عسكرية لدولة أخرى على ترابها", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 1 },
    { id: 42, text: "يجب على الدولة تطبيق مبدأ المعاملة بالمثل مع كلّ مواطني دول العالم", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -0.5 },
    { id: 43, text: "يجب على الدولة منع اكتساب الجنسية من خلال الزواج إطلاقاً", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -1 },
    { id: 44, text: "يجب على الدولة تشديد قوانين العمل على الوافدين وتسهيلها على المواطنين", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -1 },
    { id: 45, text: "يجب على الدولة السماح باللجوء لمواطني دول الجوار في حال حصول اضطرابات في بلادهم مستقبلاً", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -0.5 },
    { id: 46, text: "يجب على الدولة منع رفع أعلام القوميات والأحزاب المختلفة دون رفع علم البلاد معها في المسيرات والمظاهرات", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: -0.5 },
    { id: 47, text: "يجب على الدولة السعي للدخول في تحالفات اقتصادية واجتماعية مع دول الجوار والحفاظ على التحالفات الموجودة مثل الجامعة العربية ومجلس التعاون الخليجي ومنظمات العالم الإسلامي", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 1 },
    { id: 48, text: "يجب على الدولة تقديم ميزات للوافدين والمقيمين لتشجيعهم على البقاء في البلاد", category: "nat_glob", categoryText: "وطنيّ مقابل عالمي", effect: 1 },
    { id: 49, text: "يجب على الدولة بناء جيش قويّ وتخصص له نسبة تزيد عن ربع ميزانية البلاد", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 50, text: "على الجيش أن يعتمد على صناعة السلاح المحلية وتخصيص أكثر من ربع ميزانية البلاد لهذا", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 51, text: "على الدولة أن تحصر تواجد الجيش على الحدود والقطعات العسكرية", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -0.5 },
    { id: 52, text: "على الدولة بناء جيش دفاعي فقط لا يعمل خارج حدودها مهما كانت الظروف", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: 1 },
    { id: 53, text: "على الدولة التعامل مع حالات انتهاك السيادة العسكرية من خلال مبدأ \"التسامح مرّة ثم الرد\" بدلاً من الرد العسكري المباشر", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: 1 },
    { id: 54, text: "لا يجب على الدولة السماح للقيادات العسكرية بالمشاركة السياسية حتى بعد خروجهم من المنظومة العسكرية", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: 1 },
    { id: 55, text: "يجب على الدولة الرد بحزم على كلّ انتهاكات السيادة من الدول الخارجية دون انتظار تبريرات الطرف المقابل او التحاور معه", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 56, text: "يجب على الدولة فرض الخدمة الإلزامية في الجيش على المواطنين", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 57, text: "يجب على الدولة أن تمتلك سلاح ردع نوعي يهدد الدول المحيطة، كالصواريخ البالستية والرؤوس الحربية فائقة التدمير", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 58, text: "يجب على الدولة أن تدخل في معاهدات دفاع مشترك مع دول الجوار والاستفادة من هذه المعاهدات لضمان أمن الحدود", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -0.5 },
    { id: 59, text: "يجب على الدولة الاحتفاظ بالسلاح الكيميائيّ كسلاح ردع استراتيجيّ", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: -1 },
    { id: 60, text: "يجب على الدولة الالتزام بمعاهدات قواعد الحرب مثل اتفاق جنيف عند القتال", category: "mil_pac", categoryText: "عسكري توسّعي مقابل سلمي انعزالي", effect: 0.5 },
    { id: 61, text: "يجب على الدولة أن تقرّ وتستخدم عقوبة الإعدام", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -1 },
    { id: 62, text: "يجب على الدولة معاقبة المخبرين والمتعاونين مع الأمن والجيش السابقين", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -1 },
    { id: 63, text: "يجب على الدولة معاقبة المجنّدين الإجباريين في الجيش السابق", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -1 },
    { id: 64, text: "يجب على الدولة مسامحة من ثبتت عليهم قضايا فساد تمت الجريمة فيها ضمن مؤسسات النظام السابق", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: 1 },
    { id: 65, text: "يجب على الدولة فصل كلّ الموظفين الذين ثبت توظيفهم بالواسطة دون نظر للكفاءة", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -0.5 },
    { id: 66, text: "يجب على الدولة الاستعانة بقضاة من الأمم المتحدة لتحقيق العدالة الانتقالية", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: 0.5 },
    { id: 67, text: "يجب على الدولة تجريم الاستهزاء برموز الثورة كالعلم والشهداء", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -0.5 },
    { id: 68, text: "يجب على الدولة تجريم تمجيد الأسد ورموز النظام السابق", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -0.5 },
    { id: 69, text: "يجب على الدولة حظر رفع العلم السوري الأحمر السابق واستخدامه كرمز", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -0.5 },
    { id: 70, text: "يجب على الدولة حظر المشاركة السياسية لكل الأعضاء العاملين في حزب البعث", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -0.5 },
    { id: 71, text: "يجب على الدولة توثيق أحداث الثورة في سردية رسمية يمنع الطعن بها", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: 0.5 },
    { id: 72, text: "يجب على قوانين تجريم الأسدية أن تكون ذات أثر رجعي، أي أن تشمل ما حدث قبل صدور القانون", category: "ret_rec", categoryText: "عدالة انتقالية انتقامية مقابل تصالحية", effect: -1 }
];
